#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

struct USER
{
	char name[10];
	char birth[10]; // YY-MM-DD
	char phone[20]; // ###-####-####
} person[10];

struct BOOK
{
	char title[40];
	char author[30];
	char ISBN[20];
} book[30];

int main()
{
	struct USER person[] = {
	{"김은숙","60-09-13","011-3026-5594"},
	{"김명훈","93-10-27","010-6741-2667"},
	{"고선영","85-04-02","010-4832-1513"},
	{"남원혁","78-11-16","010-9417-8029"},
	{"배영수","82-03-22","010-5538-9002"},
	{"박관우","99-09-05","010-2991-4184"},
	{"박경민","65-02-10","010-7052-3819"},
	{"이나윤","90-08-01","010-4335-1008"},
	{"이규원","75-05-20","010-8220-3723"},
	{"한상혁","97-12-18","010-8593-0625"},
	};

	struct BOOK book[] = {
	{"걸리버 여행기","조나단 스위프트","9788931006216"},
	{"노인과 바다","어니스트 헤밍웨이","9788954617291"},
	{"동물농장","조지 오웰","9788937460050"},
	{"난장이가 쏘아올린 작은 공","조세희","9788995151204"},
	{"아큐정전","노신","9788908061941"},
	{"카라마조프 가의 형제들","도스토예프스키","9788937461545"},
	{"차라투스트라는 이렇게 말했다","프리드리히 니체","9788931006728"},
	{"시적 정의","마사 누스바움","9788958202592"},
	{"이중나선","제임스 D. 왓슨","9788958200673"},
	{"살인자의 기억법","김영하","9788954622035"},
	{"조직이론","오석홍","9788964541296"},
	{"슈퍼 거북","유설화","9788993242300"},
	{"금오신화","김시습","9788937462047"},
	{"인형의 집","헨리크 입센","9788937460005"},
	{"아파요 아파","캘리 스트롱크","9788997366125"},
	{"우죄","야쿠마루 가쿠","9788932319827"},
	{"자연주의자","에드워드 윌슨","8983719214"},
	{"강","김순한","9788980404124"},
	{"총, 균, 쇠","재레드 다이아몬드","9788970127248"},
	{"소공녀","프란시스 버넷","8914011739"},
	{"바테크","윌리엄 벡퍼드","9788955615654"},
	{"누가 누구를 먹나","알렉산드라 미지엘린스카","9788943308971"},
	{"허수","김지용","8984820997"},
	{"비정규직","장귀연","9788970137186"},
	{"공터에서","김훈","9788965745877"},
	{"옴므파탈","이자벨 알론조","9788995897034"},
	{"대재앙","리처드 A. 포스너","8995598891"},
	{"상실의 상속","키란 데사이","9788957091418"},
	{"한 권에 잡히는 한국사","설민석","9788960762961"},
	{"망하지 않는 창업","심재수","9791187091059"},
	};

	int out[30] = { 0, };

	int opt = 0, i = 0;
	int bnum = 0, pnum = 0;
	int count;

	while (1) {
		count = 0;
		printf("[도서 관리 시스템]\n");
		printf("1. 회원목록조회\n");
		printf("2. 도서목록조회\n");
		printf("3. 대여\n");
		printf("4. 반납\n");
		printf("5. 대여목록조회\n");

		scanf("%d", &opt);
		rewind(stdin);
		switch (opt) {
		case 1:
			printf("\t이름     생년월일      휴대전화\n");
			for (i = 0; i < 10; i++) printf("%-3d    %s    %s    %s\n",i+1, person[i].name,person[i].birth,person[i].phone);
			printf("\n");
			break;

		case 2:
			printf("\t도서명\t\t\t\t저자\t\t\t\tISBN\n");
			for (i = 0; i < 30; i++) printf("%d\t%-30s\t%-20s\t\t%-10s\n",i+1, book[i].title, book[i].author, book[i].ISBN);
			printf("\n");
			break;

		case 3:
			printf("\t대출 가능 도서 목록\n");
			for (i = 0; i < 30; i++) {
				if (out[i]) continue; // 대출중인 도서는 출력되지 않음
				printf("%d. %s\n", i + 1, book[i].title);
			}
			printf("\n\t사용자 목록\n");
			for (i = 0; i < 10; i++) printf("%d. %s\n", i + 1, person[i].name);
			printf("\n대출할 도서의 번호(1 ~ 30) : ");
			do scanf("%d", &bnum);
			while ((bnum < 1) || (bnum > 30) || (out[bnum - 1]));
			printf("대출할 사용자의 번호(1 ~ 10) : ");
			do scanf("%d", &pnum);
			while ((pnum < 1) || (pnum > 10));
			out[bnum - 1] = pnum;
			printf("대출되었습니다.\n");
			break;

		case 4:
			printf("반납할 도서 번호(나가기 -> 0) : ");
			do scanf("%d", &bnum);
			while ((bnum < 0) || (bnum > 30) || (!out[bnum - 1]));
			rewind(stdin);
			if (!bnum) break;
			out[bnum - 1] = 0;
			printf("반납되었습니다.\n");
			break;

		case 5:
			printf("\t도서명\t\t\t\t대출자\n");
			for (i = 0; i < 30; i++) {
				if (!out[i]) {
					count++;
					continue; // 대출중인 도서만 출력;
				}
				printf("%d. %-30s\t%d. %-10s\n",i + 1, book[i].title, out[i], person[out[i] - 1].name);
			}
			if (count == 30) printf("\t\t대출내역이 없습니다.\n");
			break;

		default:
			printf("유효하지 않은 입력입니다.\n");
			break;
		}










	}
}